scenarii/xyz.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd"
[
<!ENTITY move_first SYSTEM "xyz_first.xml">
<!ENTITY move_east  SYSTEM "xyz_east.xml">
<!ENTITY move_west  SYSTEM "xyz_west.xml">
<!ENTITY move_north SYSTEM "xyz_north.xml">
<!ENTITY move_south SYSTEM "xyz_south.xml">
<!ENTITY move_random SYSTEM "xyz_random.xml">
]
>
<!--

Author :  Rodolphe Quiedeville
Context : Tile server

Perform a bench on tile server

Require Tsung 1.5.0 minimal

This scenario implements predicitive moves


-->
<tsung loglevel="notice" dumptraffic="protocol" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" />
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="20" unit="second">
      <users interarrival="1" unit="second" maxnumber="1"></users>
    </arrivalphase>
  </load>

  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">tsung 1.5.0</user_agent>
    </option>
  </options>

 <sessions>

   <session name='desktop' probability='100'  type='ts_http'>
     <!-- set the map size in pixel defined in the application
          in this case with a default tile's size of 256x256
          the map is a square 2x2
     -->
     <setdynvars sourcetype="value" value="960">
       <var name="map_width" />
     </setdynvars>
     <setdynvars sourcetype="value" value="960">
       <var name="map_height" />
     </setdynvars>

     <setdynvars sourcetype="value" value="atlantic,baltic,adriatic">
       <var name="xyz_layers" />
     </setdynvars>

     <!-- set the first url
	  Corresponding to the top left tile when accessing the
	  map for the first time
     -->
     <setdynvars sourcetype="value" value="8/109/121">
       <var name="first_url" />
     </setdynvars>

     &move_first;
     &move_east;
     &move_north;
     &move_west;
     &move_south;
     &move_random;
   </session>

 </sessions>
</tsung>